Revit 2027 API
ElectricalSetting.RemoveWireType Method
 Remove wire type definition from project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveWireType(
	WireType wireType
)
Public Sub RemoveWireType (
	wireType As WireType
)
public:
void RemoveWireType(
	WireType^ wireType
)
member RemoveWireType :
        wireType : WireType -> unit
Parameters
wireType WireType
Exceptions
Exception | Condition
InvalidOperationException |  Wire type can be removed only if it is not used, otherwise an exception will be thrown.
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace